{"format": "layers-model", "generatedBy": "keras v2.7.0", "convertedBy": "TensorFlow.js Converter v3.12.0", "modelTopology": {"keras_version": "2.7.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "float32", "sparse": false, "ragged": false, "name": "embedding_input"}}, {"class_name": "Embedding", "config": {"name": "embedding", "trainable": true, "batch_input_shape": [null, 100], "dtype": "float32", "input_dim": 20000, "output_dim": 50, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 100}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_2", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 32, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 6, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "binary_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}, {"class_name": "Precision", "config": {"name": "precision", "dtype": "float32", "thresholds": null, "top_k": null, "class_id": null}}, {"class_name": "Recall", "config": {"name": "recall", "dtype": "float32", "thresholds": null, "top_k": null, "class_id": null}}]], "loss_weights": null, "sample_weight_mode": null, "weighted_metrics": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0003000000142492354, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional/forward_lstm/lstm_cell_1/kernel", "shape": [50, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.5577668087155212, "scale": 0.01276858039930755, "original_dtype": "float32"}}, {"name": "bidirectional/forward_lstm/lstm_cell_1/recurrent_kernel", "shape": [128, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8666133763743382, "scale": 0.0069329070109947055, "original_dtype": "float32"}}, {"name": "bidirectional/forward_lstm/lstm_cell_1/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.7435652120440613, "scale": 0.007910268213234695, "original_dtype": "float32"}}, {"name": "bidirectional/backward_lstm/lstm_cell_2/kernel", "shape": [50, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.8529367559096392, "scale": 0.014037399665982116, "original_dtype": "float32"}}, {"name": "bidirectional/backward_lstm/lstm_cell_2/recurrent_kernel", "shape": [128, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.0952711049248192, "scale": 0.008297508370642569, "original_dtype": "float32"}}, {"name": "bidirectional/backward_lstm/lstm_cell_2/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8865996627246632, "scale": 0.009046935333925135, "original_dtype": "float32"}}, {"name": "bidirectional_1/forward_lstm_1/lstm_cell_4/kernel", "shape": [256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.9961854338645935, "scale": 0.00897464354832967, "original_dtype": "float32"}}, {"name": "bidirectional_1/forward_lstm_1/lstm_cell_4/recurrent_kernel", "shape": [64, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8318092402289896, "scale": 0.006931743668574913, "original_dtype": "float32"}}, {"name": "bidirectional_1/forward_lstm_1/lstm_cell_4/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5477652596492394, "scale": 0.007825217994989133, "original_dtype": "float32"}}, {"name": "bidirectional_1/backward_lstm_1/lstm_cell_5/kernel", "shape": [256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.2945277578690473, "scale": 0.010193131951724782, "original_dtype": "float32"}}, {"name": "bidirectional_1/backward_lstm_1/lstm_cell_5/recurrent_kernel", "shape": [64, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8781880119267632, "scale": 0.006703725281883689, "original_dtype": "float32"}}, {"name": "bidirectional_1/backward_lstm_1/lstm_cell_5/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.4643644094467163, "scale": 0.007739406824111938, "original_dtype": "float32"}}, {"name": "bidirectional_2/forward_lstm_2/lstm_cell_7/kernel", "shape": [128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.9432047208150228, "scale": 0.006737176577250163, "original_dtype": "float32"}}, {"name": "bidirectional_2/forward_lstm_2/lstm_cell_7/recurrent_kernel", "shape": [32, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.9835821448587904, "scale": 0.007868657158870323, "original_dtype": "float32"}}, {"name": "bidirectional_2/forward_lstm_2/lstm_cell_7/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.46268239138173123, "scale": 0.007462619215834375, "original_dtype": "float32"}}, {"name": "bidirectional_2/backward_lstm_2/lstm_cell_8/kernel", "shape": [128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8369051257769267, "scale": 0.0063885887463887535, "original_dtype": "float32"}}, {"name": "bidirectional_2/backward_lstm_2/lstm_cell_8/recurrent_kernel", "shape": [32, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.7990733583768209, "scale": 0.0058326522509257, "original_dtype": "float32"}}, {"name": "bidirectional_2/backward_lstm_2/lstm_cell_8/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5096798990287033, "scale": 0.006706314460903991, "original_dtype": "float32"}}, {"name": "dense/kernel", "shape": [64, 6], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -2.3712991948221243, "scale": 0.016241775307000852, "original_dtype": "float32"}}, {"name": "dense/bias", "shape": [6], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.3464455548454732, "scale": 0.007012737264820173, "original_dtype": "float32"}}, {"name": "embedding/embeddings", "shape": [20000, 50], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.530702787287095, "scale": 0.011596233237023447, "original_dtype": "float32"}}]}]}